<script setup>
const faqValues = [
  {
    question: 'Можно ли доставить товар в другой город/страну?',
    answer:
      'Мы доставляем наши товары по всей России и странам СНГ. Москва и Московская область - 300₽, ' +
      'Россия и страны СНГ - 500₽.'
  },
  {
    question: 'Могу я получить бесплатную доставку?',
    answer:
      'Вы можете оформить бесплатную доставку в любой город России и стран СНГ при заказе от 5000₽.'
  },
  {
    question: 'Вы можете упаковать заказ в подарочную упаковку?',
    answer:
      'Конечно! Если вам необходимо оформить заказ в подарок, укажите ФИО и адрес получателя и не ' +
      'забудьте поставить галочку в строке "В подарок". Мы упакуем заказ и отправим сразу на адрес' +
      'виновника торжества.'
  },
  {
    question: 'Что делать, если товар пришёл повреждённым, и я хочу оформить возврат?',
    answer:
      'Не волнуйтесь и позвоните нам на горячую линию. Вам на почту вышлют бланк заявления по ' +
      'браку. Вам необходимо его заполнить и выслать ответным письмом скан заявления и ' +
      'фотоповреждённого товара. Рассмотрение заявления занимает 3-5 рабочих дней, после чего ' +
      'деньги вернутся вам на счёт.'
  }
]
</script>

<template>
  <h2 class="text-center">FAQ</h2>
  <div class="container-wrapper" v-for="(v, i) of faqValues" :key="i">
    <div class="container faq-container">
      <h3>{{ v.question }}</h3>
      <div>
        {{ v.answer }}
      </div>
    </div>
  </div>
</template>

<style>
.faq-container {
  width: 100%;
}
</style>
